/* %1$@ = current page; %2$@ = number of pages */
"%1$@ of %2$@" = "%1$@ / %2$@";

/* %1$@ = source name (e.g. “another app”); %2$@ = non-relative localized date/time string (e.g. “Dec 1, 2017 at 3:53 PM”) */
"This shortcut was imported from %1$@ on %2$@." = "Tämä oikotie tuotiin apista %1$@ %2$@.";

/* %1$@ = source name (e.g. “another app”); %2$@ = relative localized date/time string (e.g. “yesterday at 3:53 PM”) */
"This shortcut was imported from %1$@ %2$@." = "Tämä oikotie tuotiin apista %1$@ %2$@.";

/* %@ = action name */
"Add “%@”" = "Lisää ”%@”";

/* %@ = action name */
"Remove “%@”" = "Poista %@";

/* %@ = service name */
"Do you want to sign out of %@ in Shortcuts?" = "Kirjaudutaanko ulos apista %@ Oikoteissä?";

/* %@ = service name */
"Do you want to sign out of %@?" = "Kirjaudutaanko ulos apista %@?";

/* %@ = source app name */
"This shortcut was imported from %@. Are you sure you want to run it?" = "Tämä oikotie on tuotu (%@). Suoritetaanko se?";

/* %@ = type (can also be empty string); e.g. “as Date”; above it, there is a variable name such as “Event” */
"as %@" = "%@";

/* %@=action name */
"Delete the actions inside “%@”, too?" = "Poistetaanko myös toiminnon ”%@” sisällä olevat toiminnot?";

/* %@=app name */
"Install %@" = "Asenna %@";

/* A label for the row in settings that shows the Siri phrase that the user has configured for a workflow */
"Siri Phrase" = "Siri-lause";

/* Access resource action settings title */
"Accounts" = "Tilit";

/* Accessibility accouncement */
"Finished editing shortcuts" = "Oikoteiden muokkaus valmis";

/* Accessibility accouncement; %@=action name */
"Favorited %@" = "%@ asetettu suosikiksi";

/* Accessibility accouncement; %@=action name */
"Un-favorited %@" = "%@ poistettu suosikeista";

/* Accessibility accouncement; shortcut started running */
"Running shortcut" = "Suoritetaan oikotietä";

/* Accessibility action */
"Delete shortcut" = "Poista oikotie";

/* Accessibility action */
"Duplicate shortcut" = "Monista oikotie";

/* Accessibility action */
"Favorite Action" = "Aseta toiminto suosikiksi";

/* Accessibility action */
"Rename shortcut" = "Nimeä oikotie uudelleen";

/* Accessibility action */
"Un-favorite Action" = "Poista toiminto suosikeista";

/* Accessibility action or discoverability title */
"Edit shortcut" = "Muokkaa oikotietä";

/* Accessibility action or discoverability title */
"Run shortcut" = "Suorita oikotie";

/* Accessibility annoucement when inserting an action to a shortcut; %@ = action name */
"added %@ to shortcut" = "%@ lisättiin oikotiehen";

/* Accessibility annoucement; input types that are accepted */
"Accepted Input Types" = "Hyväksytyt syötetyypit";

/* Accessibility announcement */
"Closed variables tray" = "Suljettu muuttujien alusta";

/* Accessibility announcement */
"Editing shortcuts" = "Muokataan oikoteitä";

/* Accessibility announcement */
"Opened variables tray" = "Avattu muuttujien alusta";

/* Accessibility announcement spoken aloud when the user starts dragging */
"dragging" = "vedetään";

/* Accessibility announcement that shortcut finished running */
"Shortcut finished" = "Oikotie valmis";

/* Accessibility announcement when inserting an action above another action, %1$@ & %2$@ = action names */
"added %1$@ to shortcut above %2$@" = "%1$@ lisättiin oikotiehen toiminnon %2$@ yläpuolelle";

/* Accessibility announcement when inserting an action below another action, %1$@ & %2$@ = action names */
"added %1$@ to shortcut below %2$@" = "%1$@ lisättiin oikotiehen toiminnon %2$@ alle";

/* Accessibility announcement when moving an action in a shortcut above another action; %@=action name */
"moved above %@" = "siirretty toiminnon %@ yläpuolelle";

/* Accessibility announcement when moving an action in a shortcut below another action; %@=action name */
"moved below %@" = "siirretty toiminnon %@ alapuolelle";

/* Accessibility announcement when removing an action from a shortcut; %@=action name */
"removed %@" = "%@ poistettu";

/* Accessibility announcement; %@ = shortcut name */
"Duplicated %@" = "Monistettu %@";

/* Accessibility announcement; collapsed parameter */
"collapsed" = "pienennetty";

/* Accessibility announcement; dragging a shortcut */
"Dragging" = "Vetäminen";

/* Accessibility announcement; expanded parameter */
"expanded" = "laajennettu";

/* Accessibility announcement; shortcut stopped running because it was paused */
"Shortcut stopped" = "Oikotie pysäytetty";

/* Accessibility hint */
"Closes the shortcut" = "Sulkee oikotien";

/* Accessibility hint */
"Creates a new shortcut" = "Luo uuden oikotien";

/* Accessibility hint */
"Deletes the selected shortcuts" = "Poistaa valitut oikotiet";

/* Accessibility hint */
"Double-tap to add to the bottom of the shortcut. Double-tap and hold, then drag to customize the position in the shortcut." = "Lisää oikotien loppuun kaksoisnapauttamalla. Kaksoisnapauta ja pidä ja muokkaa sitten sijaintia oikotiessä vetämällä.";

/* Accessibility hint */
"Draggable. Double-tap and hold, wait for the sound, then drag to re-order. Double tap to select." = "Vedettävissä. Kaksoisnapauta ja pidä, odota ääntä ja järjestä sitten uudelleen vetämällä. Valitse kaksoisnapauttamalla.";

/* Accessibility hint */
"Duplicates the selected shortcuts" = "Monistaa valitut oikotiet";

/* Accessibility hint */
"This shortcut will be displayed in the Shortcuts action extension (in the iOS share menu) when the content being shared is one of the types you select here." = "Tämä oikotie näkyy Oikotiet-toimintolaajennuksessa (iOS-jakovalikossa), kun jaettava sisältö on jokin tässä valituista tyypeistä.";

/* Accessibility hint */
"Turns off shortcut editing mode" = "Laittaa oikotien muokkaustilan pois päältä";

/* Accessibility hint */
"Turns on shortcut editing mode" = "Laittaa oikotien muokkaustilan päälle";

/* Accessibility hint for collapsing the actions drawer */
"Double-tap to collapse the actions drawer to half screen" = "Pienennä toimintolaatikko puolikkaalle näytölle kaksoisnapauttamalla";

/* Accessibility hint for expanding the actions drawer */
"Double-tap to fully expand the actions drawer" = "Laajenna toimintolaatikko kaksoisnapauttamalla";

/* Accessibility hint on action */
"Double-tap to read the action description." = "Lue toiminnon kuvaus kaksoisnapauttamalla.";

/* Accessibility hint on action */
"Draggable. Double-tap and hold, wait for the sound, then drag to re-order. Double-tap to read the action description." = "Vedettävissä. Kaksoisnapauta ja pidä, odota ääntä ja järjestä sitten uudelleen vetämällä. Lue toiminnon kuvaus kaksoisnapauttamalla.";

/* Accessibility hint; Workflow Sync switch control */
"Double tap to toggle setting" = "Vaihda asetusta kaksoisnapauttamalla";

/* Accessibility hint; choose parameter */
"Double tap to choose" = "Valitse kaksoisnapauttamalla";

/* Accessibility hint; collapse parameter */
"Double-tap to collapse" = "Pienennä kaksoisnapauttamalla";

/* Accessibility hint; double tap to insert variable */
"Double tap to insert" = "Lisää kaksoisnapauttamalla";

/* Accessibility hint; expand parameter */
"Double-tap to expand" = "Laajenna kaksoisnapauttamalla";

/* Accessibility hint; shortcut cell; %@=shortcut name */
"Runs the shortcut %@" = "Suorittaa oikotien %@";

/* Accessibility label */
"Add Tag" = "Lisää tunniste";

/* Accessibility label */
"Close" = "Sulje";

/* Accessibility label */
"Create Shortcut" = "Luo oikotie";

/* Accessibility label */
"Show Keyboard" = "Näytä näppäimistö";

/* Accessibility label for containers of nested actions, ex: Inside of Repeat */
"Inside of %@" = "Kohteen %@ sisällä";

/* Accessibility label or discoverability title */
"Redo" = "Tee sittenkin";

/* Accessibility label or discoverability title */
"Undo" = "Peru";

/* Accessibility label to convey minimized state of actions table view */
"Minimized" = "Pienennetty";

/* Accessibility label to convey the collapsed state of the actions table view when it is only partially expanded */
"Half screen" = "Puolikas näyttö";

/* Accessibility label to convey the fully expanded state of the actions table view */
"Full screen" = "Koko näyttö";

/* Accessibility label; %@ = action name, %d = action progress; e.g. Download URL action - Running - 38 percent completed */
"%@ action - Running - %d percent completed" = "Toiminto %@ – suoritetaan – %d prosenttia valmis";

/* Accessibility label; %@ = action name; e.g. Show Alert action, New Ulysses Group action */
"%@ action" = "Toiminto %@";

/* Accessibility label; remove search filter */
"Remove filter" = "Poista suodatin";

/* Accessibility label; shortcut cell not selected; %@=shortcut name */
"%@ (not selected)" = "%@ (ei valittu)";

/* Accessibility value; switch is on */
"On" = "Päällä";

/* Accessiblity announcement; release finger to remove; %@=action name */
"Release to remove %@" = "Poista %@ vapauttamalla";

/* Action does not do anything to input and simply returns it as the output */
"This action passes input through as output." = "Tämä toiminto antaa syötteen eteenpäin tuotoksena.";

/* Action extension input variable description */
"Gets the input that was passed into the beginning of the shortcut." = "Hakee syötteen joka annettiin oikotien alkuun.";

/* Action extension; no Share Sheet shortcuts */
"You don’t have any Share Sheet shortcuts yet.\n\nTo add one, create a shortcut and turn on “Show in Share Sheet” in its settings." = "Sinulla ei vielä ole yhtään jakoikkunaoikoteitä.\n\nLisää sellainen luomalla oikotie ja laittamalla sen asetuksissa ”Näytä jakoikkunassa” päälle.";

/* Action extension; no search results */
"No shortcuts match the search." = "Yksikään oikotie ei vastaa hakua.";

/* Action extension; no shortcuts */
"You don’t have any shortcuts yet." = "Sinulla ei ole vielä yhtään oikotietä.";

/* Actions provided by Siri Suggestions; title or button */
"Siri Suggestions" = "Siri-ehdotukset";

/* Activity subject; %@ = shortcut name */
"Shortcut: %@" = "Oikotie: %@";

/* Add action to a shortcut button title */
"Add to this shortcut" = "Lisää tämä oikotiehen";

/* Add search filter */
"Add Filter" = "Lisää suodatin";

/* Alert body for creating iCloud link */
"Anyone with access to this shared link will be able to view the contents of this shortcut." = "Kaikki, joilla on pääsy tähän jaettuun linkkiin, näkevät tämän oikotien sisällön.";

/* Alert title */
"Error" = "Virhe";

/* Alert title for creating iCloud link */
"Create iCloud Link" = "Luo iCloud-linkki";

/* Allow access to service */
"Allow Access" = "Salli käyttö";

/* App not installed; accessiblity hint */
"(Not Installed) %@" = "(Ei asennettu) %@";

/* App search view; navigation bar title */
"Choose App" = "Valitse appi";

/* App search view; no results */
"No results." = "Ei tuloksia.";

/* App search view; search bar placeholder */
"Search apps…" = "Etsi appeja…";

/* Apple Watch complication */
"Complication" = "Komplikaatio";

/* Apple Watch shortcuts empty state */
"You don’t have any Apple Watch shortcuts yet." = "Sinulla ei ole vielä yhtään Apple Watch -oikotietä.";

/* Apple Watch shortcuts empty state description */
"Select which shortcuts should be displayed in the Shortcuts Complication on the clock face of your Apple Watch.\n\nOver time, Shortcuts will optimize when your shortcuts are shown in the Complication based on when you run them." = "Valitse, mitkä oikotiet näytetään Apple Watchin kellotaulussa olevassa Oikotiet-komplikaatiossa.\n\nAjan mittaan Oikotiet optimoi sen, milloin oikotiet näytetään komplikaatiossa sen mukaan, milloin suoritat niitä.";

/* Apps category */
"Apps" = "Apit";

/* Ask When Run variable description */
"Asks you to enter text when this shortcut runs." = "Pyytää syöttämään tekstin, kun tätä oikotietä suoritetaan.";

/* Boolean false */
"False" = "Epätosi";

/* Boolean true */
"True" = "Tosi";

/* Button */
"Back" = "Takaisin";

/* Button */
"Cancel" = "Kumoa";

/* Button */
"Choose Variable" = "Valitse muuttuja";

/* Button */
"Clear" = "Tyhjennä";

/* Button */
"Delete Actions" = "Poista toiminnot";

/* Button */
"Delete Shortcut" = "Poista oikotie";

/* Button */
"Done" = "Valmis";

/* Button */
"Get More Shortcuts" = "Hae lisää oikoteitä";

/* Button */
"Go Back" = "Takaisin";

/* Button */
"Help" = "Ohje";

/* Button */
"Keep Actions" = "Pidä toiminnot";

/* Button */
"Next" = "Seuraava";

/* Button */
"OK" = "OK";

/* Button */
"Remove Action" = "Poista toiminto";

/* Button */
"Remove Action From Shortcut" = "Poista toiminto oikotiestä";

/* Button */
"Remove Photo" = "Poista kuva";

/* Button */
"Select Magic Variable" = "Valitse taikamuuttuja";

/* Button */
"Select Photo" = "Valitse kuva";

/* Button */
"Show Action Settings" = "Näytä toiminnon asetukset";

/* Button */
"Show Actions" = "Näytä toiminnot";

/* Button */
"Sign Out" = "Kirjaudu ulos";

/* Button */
"Take Photo" = "Ota kuva";

/* Button in Share Sheet; add this shortcut to home screen */
"Add to Home Screen (Share Sheet)" = "Lisää Koti-valikkoon";

/* Button in Workflow settings; add this shortcut to home screen */
"Add to Home Screen (Workflow Settings)" = "Lisää Koti-valikkoon";

/* Button or title */
"Delete" = "Poista";

/* Button or title */
"Run Shortcut" = "Suorita oikotie";

/* Button or title */
"Settings" = "Asetukset";

/* Button or title */
"Variables" = "Muuttujat";

/* Button title */
"Add to Siri" = "Lisää Siriin";

/* Button title to import a shortcut */
"Get Shortcut" = "Hae oikotie";

/* Button; makes output view full screen */
"Show Result Full-Screen" = "Näytä tulos koko näytöllä";

/* Button; take a guided tour of building a workflow */
"Take a Guided Tour" = "Tee ohjattu kierros";

/* Button; used for sharing a shortcut's result */
"Share Result" = "Jaa tulos";

/* Caption above list of supported apps and services */
"This shortcut works with the following apps and services:" = "Tämä oikotie toimii seuraavien appien ja palvelujen kanssa:";

/* Choose an item */
"Choose" = "Valitse";

/* Conditional AND */
"and" = "ja";

/* Conditional actions settings cell */
"Put Back “Otherwise”" = "Aseta takaisin ”Muussa tapauksessa”";

/* Conditional actions settings footer text */
"Actions placed after “Otherwise” will run if the condition is false." = "Muussa tapauksessa -kohdan jälkeen olevat toiminnot suoritetaan, jos ehto ei toteudu.";

/* Conditional actions settings navigation bar title */
"If Action" = "Jos-toiminto";

/* Confirmation HUD when link copies */
"Link copied" = "Linkki kopioitu";

/* Confirmation dialog, stop sharing */
"Are you sure you want to stop sharing this shortcut? The iCloud link will be deleted and will no longer work." = "Lopetetaanko tämän oikotien jakaminen? iCloud-linkki poistetaan eikä se toimi enää.";

/* Confirmation when deleting selected shortcut */
"This shortcut will be deleted from all of your iCloud devices." = "Tämä oikotie poistetaan kaikista iCloud-laitteistasi.";

/* Confirmation when deleting selected shortcuts */
"These shortcuts will be deleted from all of your iCloud devices." = "Nämä oikotiet poistetaan kaikista iCloud-laitteistasi.";

/* Contact field; %1$@ = user entered contact; %2$@ = “a phone number or email address” or “an email address” or “a phone number” */
"“%1$@” doesn’t look like %2$@. Did you mean to add a contact?" = "%1$@ ei näytä olevan %2$@. Halusitko lisätä yhteystiedon?";

/* Contact field; %@ = user entered contact */
"Use “%@” Anyway" = "Käytä silti: ”%@”";

/* Contact field; accessibility label */
"Add Contact" = "Lisää yhteystieto";

/* Contact field; button */
"Search Contacts" = "Etsi Yhteystiedoista";

/* Contact field; supported type string */
"a phone number" = "puhelinnumero";

/* Contact field; supported type string */
"a phone number or email address" = "puhelinnumero tai sähköpostiosoite";

/* Contact field; supported type string */
"an email address" = "sähköpostiosoite";

/* Content Types category */
"Content Types" = "Sisältötyypit";

/* Copy link to shortcut */
"Copy Link" = "Kopioi linkki";

/* Copy the link to a shortcut */
"Copy iCloud Link" = "Kopioi iCloud-linkki";

/* Custom date format alert message */
"This format follows the patterns in Unicode Technical Standard #35." = "Tämä muoto noudattaa Unicoden teknistä standardia numero 35.";

/* Custom date format alert title */
"Custom Date Format" = "Muokattu päivämäärämuoto";

/* Custom date formatting style */
"Custom" = "Muokattu";

/* Custom time format title */
"Custom Format" = "Muokattu muoto";

/* Default option */
"Default" = "Oletus";

/* Delete all shortcuts */
"Delete All" = "Poista kaikki";

/* Delimeter for input types */
", " = ", ";

/* Deselect all input types */
"Deselect All" = "Poista kaikkien valinta";

/* Dictionary key placeholder */
"Key" = "Näppäin";

/* Discoverability or accessibility title */
"Shortcut Settings" = "Oikotien asetukset";

/* Discoverability or accessibility title */
"Stop Shortcut" = "Lopeta oikotie";

/* Discoverability title */
"Close shortcut" = "Sulje oikotie";

/* Discoverability title */
"Search actions" = "Etsi toimintoja";

/* Discoverability title */
"Stop shortcut" = "Lopeta oikotie";

/* Displayed next to a switch to configure whether or not a workflow should appear in the share sheet */
"Show in Share Sheet" = "Näytä jakoikkunassa";

/* Displayed next to a switch to configure whether or not a workflow should be shown in the Workflow widget */
"Show in Widget" = "Näytä widgetissä";

/* Displayed next to a switch to configure whether or not a workflow should be shown in the watch complication */
"Show in Complication" = "Näytä komplikaatiossa";

/* Displayed next to a switch to configure whether or not a workflow should be shown on the Apple Watch */
"Show on Apple Watch" = "Näytä Apple Watchissa";

/* Duplicate a shortcut */
"Duplicate Shortcut" = "Monista oikotie";

/* Duplicate shortcut */
"Duplicate" = "Monista";

/* Edit import questions back bar button title */
"Questions" = "Kysymykset";

/* Error message */
"No options available." = "Valintoja ei ole saatavilla.";

/* Error message; %@=error info */
"Could not load the App Store.\n\n%@" = "App Storeen ei voitu ladata.\n\n%@";

/* Explanation of what users can do by selecting the shortcuts shown underneath the text */
"Run shortcuts quickly using the widget." = "Suorita oikoteitä nopeasti widgetillä.";

/* Favorite button title - action is NOT yet favorited */
"Favorite" = "Suosikki";

/* Favorite button title - action is favorited */
"Favorited" = "On suosikki";

/* Filled in with the user's account name, e.g. Account: johnmiller@gmail.com */
"Account: %@" = "Tili: %@";

/* Find and filter UI; all of the below conditions are true */
"All of the following are true" = "Kaikki seuraavista toteutuvat";

/* Find and filter UI; any one of the below conditions are true */
"Any of the following are true" = "Mikä tahansa seuraavista toteutuu";

/* Find filter UI layout for filter with a property and an operator (e.g. '`Start Date` `is today`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator}" = "${property} ${operator}";

/* Find filter UI layout for filter with a property and an operator and a follow up requirement (e.g. '`Start Date` `is today` `and`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${and}" = "${property} ${operator} ${and}";

/* Find filter UI layout for filter with a property, operator and 2 values (e.g. '`Start Date` `is between` `8/13/18` `and` `8/16/18`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value} ${operator_and} ${other_value}" = "${property} ${operator} ${value} ${operator_and} ${other_value}";

/* Find filter UI layout for filter with a property, operator and 2 values and a follow up requirement (e.g. '`Start Date` `is between` `8/13/18` `and` `8/16/18` `and`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value} ${operator_and} ${other_value} ${and}" = "${property} ${operator} ${value} ${operator_and} ${other_value} ${and}";

/* Find filter UI layout for filter with a property, operator and value (e.g. '`Calendar` `is` `Work`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value}" = "${property} ${operator} ${value}";

/* Find filter UI layout for filter with a property, operator and value and a follow up requirement (e.g. '`Calendar` `is` `Work` `and`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value} ${and}" = "${property} ${operator} ${value} ${and}";

/* Find filter UI layout for filter with a property, operator, value and unit (e.g. '`Start Date` `is in the next` `5` `days`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value} ${unit}" = "${property} ${operator} ${value} ${unit}";

/* Find filter UI layout for filter with a property, operator, value and unit and a follow up requirement (e.g. '`Start Date` `is in the next` `5` `days` `and`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${operator} ${value} ${unit} ${and}" = "${property} ${operator} ${value} ${unit} ${and}";

/* Find filter UI layout for filter with just a property (e.g. '`Is All Day`'). This is used just for layout and the content between ${} should not be localized */
"${property}" = "${property}";

/* Find filter UI layout for filter with just a property and a follow up requirement (e.g. '`Is All Day` `and`'). This is used just for layout and the content between ${} should not be localized */
"${property} ${and}" = "${property} ${and}";

/* Find filter UI operator */
"begins with" = "alkaa";

/* Find filter UI operator */
"contains" = "sisältää";

/* Find filter UI operator */
"does not contain" = "ei sisällä";

/* Find filter UI operator */
"ends with" = "loppuu";

/* Find filter UI operator */
"is" = "on";

/* Find filter UI operator */
"is after" = "on jälkeen";

/* Find filter UI operator */
"is before" = "on ennen";

/* Find filter UI operator */
"is between" = "on välillä";

/* Find filter UI operator */
"is exactly" = "on täsmälleen";

/* Find filter UI operator */
"is greater than" = "on suurempi kuin";

/* Find filter UI operator */
"is greater than or equal to" = "on suurempi tai yhtä suuri kuin";

/* Find filter UI operator */
"is in the last" = "on viimeisen";

/* Find filter UI operator */
"is in the next" = "seuraa ajassa";

/* Find filter UI operator */
"is larger than" = "on suurempi kuin";

/* Find filter UI operator */
"is larger than or equal to" = "on suurempi tai yhtä kuin";

/* Find filter UI operator */
"is less than" = "on pienempi kuin";

/* Find filter UI operator */
"is less than or equal to" = "on pienempi tai yhtä suuri kuin";

/* Find filter UI operator */
"is longer than" = "on pidempi kuin";

/* Find filter UI operator */
"is longer than or equal to" = "on pidempi tai yhtä kuin";

/* Find filter UI operator */
"is not" = "ei ole";

/* Find filter UI operator */
"is not exactly" = "ei ole täsmälleen";

/* Find filter UI operator */
"is not on" = "ei ole";

/* Find filter UI operator */
"is on" = "on";

/* Find filter UI operator */
"is shorter than" = "on lyhyempi kuin";

/* Find filter UI operator */
"is shorter than or equal to" = "on lyhyempi tai yhtä kuin";

/* Find filter UI operator */
"is smaller than" = "on pienempi kuin";

/* Find filter UI operator */
"is smaller than or equal to" = "on pienempi tai yhtä kuin";

/* Find filter UI operator */
"is today" = "on tänään";

/* Footer for section */
"Run this shortcut with your voice by adding it to Siri." = "Suorita tämä oikotie äänelläsi lisäämällä se Siriin.";

/* Footer for table view section */
"Use this shortcut from other apps by opening the share sheet and tapping Shortcuts." = "Käytä muiden appien oikotietä avaamalla jakoikkuna ja napauttamalla Oikotiet.";

/* For a dictionary; description */
"Enter a key to extract its value from the dictionary, or leave blank to get the entire dictionary." = "Poimi avaimen arvo sanakirjasta syöttämällä avain tai hae koko sanakirja jättämällä tyhjäksi.";

/* Format with local device name, for disambiguating sync conflicts to the user */
"%@ (This Device)" = "%@ (tämä laite)";

/* Full name of contact */
"Full Name" = "Nimi";

/* Full street address of location */
"Full Street Address" = "Täysi katuosoite";

/* Get property */
"Get" = "Hae";

/* Get value for a dictionary key */
"Get Value for Key" = "Hae avaimen arvo";

/* Go to next import question */
"Continue" = "Jatka";

/* Guided tour; drag actions to here hint */
"…to here" = "…tähän";

/* Guided tour; drag actions to here hint (accessibility hint) */
"Drag actions to here" = "Vedä toiminnot tänne";

/* Handoff info */
"This action, when run on Apple Watch, will require you to use Handoff and continue on your iPhone." = "Kun tämä toiminto suoritetaan Apple Watchissa, sinun on käytettävä Handoffia ja jatkettava iPhonessa.";

/* Health quantity unit (e.g. mL); title */
"Unit" = "Yksikkö";

/* ISO 8601 date formatting style */
"ISO 8601" = "ISO 8601";

/* ISO 8601 date formatting style */
"ISO 8601 Time" = "ISO 8601 - aika";

/* Icon editor accessibility label; %1$@ = glyph name, %2$@ = color name */
"%1$@ glyph, %2$@ background color" = "Glyyfi %1$@, taustaväri %2$@";

/* Icon editor tip text */
"Choose a custom image to use when this shortcut is added to the home screen." = "Valitse kuva, jota käytetään, kun tämä oikotie on lisätty Koti-valikkoon.";

/* Icon editor tip text */
"The image above will be used when this shortcut is added to the home screen." = "Yllä olevaa kuvaa käytetään, kun tämä oikotie on lisätty Koti-valikkoon.";

/* Icon editor; accessibility label */
"Icon Preview" = "Kuvakkeen esikatselu";

/* Icon editor; accessibility label */
"Shortcut icon editor" = "OIkotie-kuvakkeen editori";

/* Icon editor; segmented control option */
"Color" = "Väri";

/* Icon editor; segmented control option */
"Glyph" = "Glyyfi";

/* Icon editor; segmented control option */
"Home Screen" = "Koti-valikko";

/* Import questions */
"Questions added here will be asked when this shortcut is imported on a different device. Answers to these questions will be filled into the shortcut." = "Tässä lisätyt kysymykset esitetään, kun tämä oikotie tuodaan eri laitteeseen. Vastaukset näihin kysymyksiin täytetään oikotiehen.";

/* Import questions */
"You can try your import questions using the “Customize Shortcut” button in this shortcut's settings." = "Voit kokeilla tuontikysymyksiäsi käyttämällä Muokkaa oikotietä -painiketta tämän oikotien asetuksissa.";

/* Import questions detail view */
"Default Answer" = "Oletusvastaus";

/* Import questions detail view */
"Question Text" = "Kysymysteksti";

/* Import questions detail view */
"Type a question here…" = "Kirjoita kysymys tähän…";

/* Import questions details view; navigation bar title */
"Details" = "Lisätietoja";

/* Import questions; button */
"Add New Question…" = "Lisää uusi kysymys…";

/* Import questions; choose a parameter prompt */
"Choose a parameter from one of the actions below." = "Valitse parametri yhdestä alla olevista toiminnoista.";

/* Import questions; choose parameter title */
"Choose a Parameter" = "Valitse parametri";

/* Import questions; no actions error message */
"This shortcut has no actions. Please add some actions to your shortcut before setting up Import Questions." = "Tässä oikotiessä ei ole toimintoja. Lisää oikotiehen toimintoja ennen kuin otat käyttöön Tuontikysymykset.";

/* Indicates what types of input the shortcut accepts; %@=list of types */
"This shortcut accepts %@" = "Oikotie hyväksyy: %@";

/* Input types of action */
"Input" = "Syöte";

/* Input variable description */
"Gets the output of the previous action." = "Hakee edellisen toiminnon tuotoksen.";

/* Install app icon; should match App Store GET button */
"GET" = "HAE";

/* Instructions on building a shortcut */
"Add actions from the bottom to build your shortcut." = "Rakenna oikotie lisäämällä toimintoja alhaalta.";

/* Instructions on building a shortcut; please make sure to account for right-to-left layout */
"Add actions from the left to build your shortcut." = "Rakenna oikotie lisäämällä toimintoja vasemmalta.";

/* Item can be anything */
"anything" = "mikä tahansa";

/* Keep all shortcuts */
"Keep All" = "Pidä kaikki";

/* Keep shortcuts */
"Keep" = "Pidä";

/* Keep shortcuts; %lu = number of shortcuts */
"Keep %lu" = "Pidä %lu";

/* Label for accessibility custom action to expand actions card */
"Expand" = "Laajenna";

/* Label for accessibility custom action to minimize actions card */
"Collapse" = "Pienennä";

/* Label for types that the workflow accepts. */
"Accepted Types" = "Hyväksytyt tyypit";

/* Like 'Add new item' or 'Add new image' */
"Add %@" = "Lisää %@";

/* List editor message (value = image, string, etc.) */
"What type of value do you want to add?" = "Minkä tyyppisen arvon haluat lisätä?";

/* Long date formatting style */
"Long" = "Pitkä";

/* Manage sharing */
"Manage Sharing" = "Hallitse jakamista";

/* Medium date formatting style */
"Medium" = "Normaali";

/* Missing action error action */
"Update Shortcuts" = "Päivitä oikotiet";

/* Missing action error title */
"This action could not be found in this version of Shortcuts." = "Tästä Oikotiet-versiosta ei löydy tätä toimintoa.";

/* Name and store URL of product or item on App Store */
"Name and Store URL" = "Nimeä ja tallenna URL";

/* Name of measurement unit */
"Unit (Name)" = "Yksikkö";

/* Navigation bar title */
"Select a Magic Variable" = "Valitse taikamuuttuja";

/* Navigation bar title; resolve workflow conflicts */
"Resolve Conflicts" = "Ratkaise ristiriidat";

/* No variables avaiable error */
"⚠️ Variable not available." = "⚠️ Muuttuja ei saatavilla.";

/* None option */
"None" = "Ei mitään";

/* Note about using the action */
"Note" = "Huomautus";

/* Parameter already in use by another import question */
"Already In Use" = "Jo käytössä";

/* Parameter not supported for import question */
"Not Supported for Questions" = "Ei tuettu kysymyksille";

/* Piece of text */
"Text" = "Teksti";

/* Prompt displayed to the user when importing a shortcut where the source app is not known. */
"This shortcut was imported from another app. Are you sure you want to run it?" = "Tämä oikotie on tuotu toisesta apista. Suoritetaanko se?";

/* RFC 2822 date formatting style */
"RFC 2822" = "RFC 2822";

/* Relative date formatting style */
"Relative" = "Suhteellinen";

/* Relative date or time formatting style */
"How Long Ago/Until" = "Kauanko sitten/kunnes";

/* Remote device name for sync conflict when not known */
"Unknown Device" = "Tuntematon laite";

/* Rename Magic Variable prompt message; %@ = action name */
"This name will be used for all of this %@ action’s Magic Variables." = "Tätä nimeä käytetään kaikille tämän toiminnon (%@) Taikamuuttujille.";

/* Rename Magic Variable prompt title */
"Rename Magic Variable" = "Nimeä taikamuuttuja uudelleen";

/* Rename shortcut alert title */
"Rename Shortcut" = "Nimeä oikotie uudelleen";

/* Rename shortcut message */
"Enter a new name for your shortcut." = "Syötä oikotielle uusi nimi.";

/* Rename workflow or variable */
"Rename" = "Nimeä uudelleen";

/* Requirements for the action (having certain apps installed, iOS version, etc.) */
"Requires" = "Vaatii";

/* Result types of action */
"Result" = "Tulos";

/* Reveal action that is associated with the variable */
"Reveal Action" = "Näytä toiminto";

/* Scripting category */
"Scripting" = "Skriptaus";

/* Search bar placeholder or keycommand discoverability title */
"Search" = "Etsi";

/* Section header title; Apple Watch complication shortcuts */
"Complication Shortcuts" = "Komplikaatioiden oikotiet";

/* Select all input types */
"Select All" = "Valitse kaikki";

/* Sentence describing the current filter. The first argument (%@) is the search action and the second argument (%@) is the property (e.g. '`Find Calendar Events Where` `Start Date`…') */
"%@ %@…" = "%@ %@…";

/* Sentence describing the current filter. The first argument (%@) is the search action, the second argument (%@) is the property and the third argument (%@) is the operator that is used (e.g. '`Find Calendar Events Where` `Start Date` `is in the next`…') */
"%@ %@ %@…" = "%@ %@ %@…";

/* Sentence describing the current filter. The first argument (%@) is the search action, the second argument (%@) is the property, the third argument (%@) is the operator that is used and the fourth argument (%@) is the value (e.g. '`Find Calendar Events Where` `Start Date` `is in the next` `5`…') */
"%@ %@ %@ %@…" = "%@ %@ %@ %@…";

/* Service name followed by account, e.g. Dropbox (johnmiller@gmail.com) */
"%@ (%@)" = "%@ (%@)";

/* Share a shortcut */
"Share Shortcut" = "Jaa oikotie";

/* Share a workflow along with a description */
"Share with Description" = "Jaa kuvauksen kanssa";

/* Share a workflow as a file */
"Share as File" = "Jaa tiedostona";

/* Share shortcut */
"Share" = "Jaa";

/* Short date formatting style */
"Short" = "Lyhyt";

/* Shortcut contains no actions error description, %@=shortcut name */
"“%@” contains no actions." = "%@ ei sisällä toimintoja.";

/* Shortcut contains no actions error title */
"Empty Shortcut" = "Tyhjä oikotie";

/* Shortcut contains no actions error title */
"No Actions" = "Ei toimintoja";

/* Shortcut description placeholder */
"Customize Shortcut…" = "Muokkaa oikotietä…";

/* Shortcut icon */
"Icon" = "Kuvake";

/* Shortcut picker; navigation bar title */
"Choose Shortcut" = "Valitse oikotie";

/* Shortcut reordering; %1$@,%2$@ = shortcut names */
"Moved between %1$@ and %2$@" = "Siirretty oikoteiden %1$@ ja %2$@ väliin";

/* Shortcut reordering; %@ = shortcut name */
"Moved to end after %@" = "Siirretty loppuun oikotien %@ perään";

/* Shortcut reordering; %@ = shortcut name */
"Moved to top before %@" = "Siirretty ylös oikotien %@ yläpuolelle";

/* Shortcut type selection view; widget info detail text */
"To use shortcuts from the Today Widget, follow a few simple steps to add the widget. Or, tap Done to set up later." = "Jos haluat käyttä oikoteitä Tänään-widgetistä, lisää widgetti suorittamalla muutama helppo vaihe. Vaihtoehtoisesti voit napauttaa Valmis ja ottaa käyttöön myöhemmin.";

/* Shortcut type selection view; widget info slogan text */
"Add the Today Widget to run shortcuts lightning fast." = "Lisää Tänään-widgetti, jotta oikotiet voidaan suorittaa salamannopeasti.";

/* Shortcut types help view; accessiblity hint */
"Screenshot of a share sheet in Safari with the Shortcuts activity highlighted" = "Näyttökuva Safarin jakoikkunasta, jossa Oikotiet-toiminto on korostettuna";

/* Shortcut types help view; info label */
"Action Extension shortcuts are run from the share sheet inside other apps." = "Toiminnon laajennusoikotiet suoritetaan jakosivulta muiden appien sisältä.";

/* Shortcut types help view; info label */
"Today Widget shortcuts are run in Notification Center by pulling down from the top of the screen." = "Tänään-widgetin oikotiet suoritetaan Ilmoituskeskuksessa, joka vedetään alas näytön yläreunasta.";

/* Shortcut types help view; title */
"Shortcut Types" = "Oikotietyypit";

/* Shortcut was deleted on a specified device */
"Deleted on %@" = "Poistettu laitteesta %@";

/* Shortcut was deleted on another device */
"Deleted on another device" = "Poistettu toisesta laitteesta";

/* Shortcut was modified on a specified device */
"Modified on %@" = "Muokattu – %@";

/* Shortcut was modified on another device */
"Modified on another device" = "Muokattu toisessa laitteessa";

/* Shortcuts picker; search bar placeholder */
"Search shortcuts…" = "Etsi oikoteitä…";

/* Shortcuts types help view; accessibility label */
"Screenshot of the Shortcuts widget in Notification Center" = "Näyttökuva Oikotiet-widgetistä Ilmoituskeskuksessa";

/* Siri phrase */
"“%@”" = "”%@”";

/* Skip gallery shortcut import configuration */
"Skip Setup" = "Ohita käyttöönotto";

/* Specifies how the automatic capitalization of the name of a shortcut should work: 0 = No auto capitalization, 1 = Only the first word, 2 = All words */
"Auto-capitalization for Shortcut Name" = "1";

/* Stop sharing the link to a shortcut */
"Stop Sharing" = "Lopeta jako";

/* Submit a workflow to the gallery */
"Submit to Gallery" = "Lähetä Galleriaan";

/* Tap to choose an option */
"Tap to Choose" = "Valitse napauttamalla";

/* Text when sharing a shortcut */
"Check out the shortcut I built!" = "Tein tällaisen oikotien!";

/* The accessibility label for the actions table view container */
"Actions Controller" = "Toimintojen ohjain";

/* The location of the share button in Safari on iPad */
"the bottom of the screen" = "näytön alaosa";

/* The location of the share button in Safari on iPad */
"the top right of the screen" = "näytön oikea yläkulma";

/* The workflow accepts anything as input. Shown like “Accepts Anything” */
"Anything" = "Mitä tahansa";

/* The workflow accepts nothing as input. Shown like “Accepts Nothing” */
"Nothing" = "Ei mitään";

/* Title */
"Actions" = "Toiminnot";

/* Title */
"Date Format" = "Päiväyksen muoto";

/* Title */
"Requires Handoff" = "Vaatii Handoffin";

/* Title */
"Shortcuts" = "Oikotiet";

/* Title */
"Time Format" = "Aikamuoto";

/* Title */
"Type" = "Tyyppi";

/* Title for action drawer categories view */
"Categories" = "Kategoriat";

/* Title for configuration page for unit */
"Unit (Title)" = "Yksikkö";

/* Title of main screen showing your library of shortcuts */
"Library" = "Kirjasto";

/* Title of the view controller that allows the user to control which shortcuts appear in the Today Widget */
"Customize Shortcuts" = "Muokkaa oikoteitä";

/* Title or button */
"Import Questions" = "Tuontikysymykset";

/* Today widget explanation */
"Boom! Your Today Widget is set up." = "Hienoa! Tänään-widgetti on otettu käyttöön.";

/* Today widget explanation */
"Next, grab some Today Widget shortcuts from the Gallery." = "Valitse seuraavaksi Tänään-widgetin oikoteitä Galleriasta.";

/* Today widget explanation */
"With the Shortcuts Today Widget, you can run shortcuts in a single tap from any app just by pulling down Notification Center." = "Oikoteiden Tänään-widgetillä voit suorittaa oikoteitä yhdellä napautuksella mistä tahansa apista vain vetämällä Ilmoituskeskuksen alas.";

/* Today widget explanation button */
"Add Widget" = "Lisää widgetti";

/* Today widget explanation button */
"View the Gallery" = "Näytä Galleria";

/* Today widget explanation; please do not localize %MODEL% */
"Run shortcuts lightning fast, from anywhere on your %MODEL%." = "Suorita oikotiet salamannopeasti, siitä riippumatta missä olet laitteessasi (%MODEL%).";

/* Unknown item */
"Unknown" = "Tuntematon";

/* Used in a phrase like 'Add new item' */
"new item" = "uusi kohde";

/* User’s favorited workflows or actions */
"Favorites" = "Suosikit";

/* Variable field placeholder */
"Variable Name" = "Muuttujan nimi";

/* Variable picker; none available error message */
"You can create a variable by adding a “Set Variable” action." = "Voit luoda muuttujan lisäämällä Aseta muuttuja -toiminnon.";

/* Varible picker; none available error title */
"No Variables Are Available" = "Muuttujia ei ole saatavilla";

/* Workflow conflicts; navigation bar back button title */
"Conflicts" = "Ristiriidat";

/* Workflow import flow title shown above import question */
"Configure This Shortcut" = "Määritä tämä oikotie";

/* Workflow name */
"Name of Shortcut" = "Nimi";

/* Workflow type selection view */
"Tap Done to continue editing your shortcut." = "Napauta Valmis ja jatka oikotien muokkaamista.";

/* Workflow types help view; accessibility hint */
"Screenshot of the Shortcuts watch app" = "Näyttökuva Oikoteiden Watch-apista";

/* Workflow types help view; info label */
"Apple Watch shortcuts are run from your wrist via the Shortcuts watch app or Complication." = "Apple Watch -oikotiet suoritetaan ranteestasi Oikotiet-apin tai komplikaation kautta.";

/* Workflow types help view; instructions label */
"How do I find the Today Widget?" = "Kuinka löydän Tänään-widgetin?";

/* iOS Today Widget */
"Today Widget" = "Tänään-widgetti";

